'use-strict'
// @ts-check

// Restrict input value by length
function trimExceededLength(elId, maxLength, callback) {
  let el = /** @type {HTMLInputElement} */ (document.getElementById(elId))
  let event = new Event('input', {bubbles: true})
  if(el.value && typeof callback === "function") {
    if(el.value !== callback(el.value)) {
      el.value = callback(el.value)
      el.dispatchEvent(event)
    }
  }
  if(el.value && el.value.length > maxLength) {
    el.value = el.value.substr(0, maxLength)
    el.dispatchEvent(event)
  }
}

/** 
 * @function isPep - compare post parameter with array of PEP positions
 * @param {string} post 
 * */
function isPep (post) {
  if (! post) return false
  if (typeof post !== "string") return false

  post = post.toUpperCase()

  /** @type {Array<string>} */
  const pepPosts = [
    "ПРЕЗИДЕНТ УКРАЇНИ", 
    "ПРЕМ’ЄР-МІНІСТР УКРАЇНИ", 
    "МІНІСТР", 
    "ЗАСТУПНИК МІНІСТРУ", 
    "ПРЕЗИДЕНТОМ УКРАЇНИ", 
    "ПРИ ПРЕЗИДЕНТІ УКРАЇНИ", 
    "КЕРІВНИК ДЕРЖАВНОГО УПРАВЛІННЯ СПРАВАМИ", 
    "ЗАСТУПНИК КЕРІВНИКА ДЕРЖАВНОГО УПРАВЛІННЯ СПРАВАМИ", 
    "СЕКРЕТАР РАДИ НАЦІОНАЛЬНОЇ БЕЗПЕКИ І ОБОРОНИ УКРАЇНИ", 
    "ЗАСТУПНИК СЕКРЕТАРЯ РАДИ НАЦІОНАЛЬНОЇ БЕЗПЕКИ І ОБОРОНИ УКРАЇНИ", 
    "НАРОДНИЙ ДЕПУТАТ УКРАЇНИ", 
    "ДЕПУТАТ",
    "ПРАВЛІННЯ НАЦІОНАЛЬНОГО БАНКУ УКРАЇНИ", 
    "РАДИ НАЦІОНАЛЬНОГО БАНКУ УКРАЇНИ", 
    "ГОЛОВА КОНСТИТУЦІЙНОГО СУДУ УКРАЇНИ", 
    "КОНСТИТУЦІЙНОГО СУДУ УКРАЇНИ", 
    "ВЕРХОВНОГО СУДУ", 
    "ВИЩОЇ РАДИ ПРАВОСУДДЯ", 
    "ВИЩОЇ КВАЛІФІКАЦІЙНОЇ КОМІСІЇ СУДДІВ УКРАЇНИ", 
    "КВАЛІФІКАЦІЙНО-ДИСЦИПЛІНАРНОЇ КОМІСІЇ ПРОКУРОРІВ", 
    "ГЕНЕРАЛЬНИЙ ПРОКУРОР", 
    "ЗАСТУПНИК ГЕНЕРАЛЬНОГО ПРОКУРОРА", 
    "ГОЛОВА СЛУЖБИ БЕЗПЕКИ УКРАЇНИ", 
    "ЗАСТУПНИК ГОЛОВИ СЛУЖБИ БЕЗПЕКИ УКРАЇНИ", 
    "ДИРЕКТОР НАЦІОНАЛЬНОГО АНТИКОРУПЦІЙНОГО БЮРО УКРАЇНИ", 
    "ЗАСТУПНИК ДИРЕКТОРА НАЦІОНАЛЬНОГО АНТИКОРУПЦІЙНОГО БЮРО УКРАЇНИ", 
    "ДИРЕКТОР ДЕРЖАВНОГО БЮРО РОЗСЛІДУВАНЬ", 
    "ЗАСТУПНИК ДИРЕКТОРА ДЕРЖАВНОГО БЮРО РОЗСЛІДУВАНЬ", 
    "ДИРЕКТОР БЮРО ФІНАНСОВИХ РОЗСЛІДУВАНЬ", 
    "ЗАСТУПНИК ДИРЕКТОРА БЮРО ФІНАНСОВИХ РОЗСЛІДУВАНЬ", 
    "ГОЛОВА НАЦІОНАЛЬНОЇ РАДИ УКРАЇНИ З ПИТАНЬ ТЕЛЕБАЧЕННЯ І РАДІОМОВЛЕННЯ", 
    "НАЦІОНАЛЬНОЇ РАДИ УКРАЇНИ З ПИТАНЬ ТЕЛЕБАЧЕННЯ І РАДІОМОВЛЕННЯ", 
    "ГОЛОВА АНТИМОНОПОЛЬНОГО КОМІТЕТУ УКРАЇНИ", 
    "АНТИМОНОПОЛЬНОГО КОМІТЕТУ УКРАЇНИ", 
    "ГОЛОВА НАЦІОНАЛЬНОГО АГЕНТСТВА З ПИТАНЬ ЗАПОБІГАННЯ КОРУПЦІЇ", 
    "ЗАСТУПНИК ГОЛОВИ НАЦІОНАЛЬНОГО АГЕНТСТВА З ПИТАНЬ ЗАПОБІГАННЯ КОРУПЦІЇ", 
    "ГОЛОВА РАХУНКОВОЇ ПАЛАТИ", 
    "РАХУНКОВОЇ ПАЛАТИ", 
    "ГОЛОВА ЦЕНТРАЛЬНОЇ ВИБОРЧОЇ КОМІСІЇ", 
    "ЦЕНТРАЛЬНОЇ ВИБОРЧОЇ КОМІСІЇ", 
    "ДЕРЖАВНИЙ КОЛЕГІАЛЬНИЙ ОРГАН", 
    "НАДЗВИЧАЙНИЙ ПОСОЛ", 
    "ПОВНОВАЖНИЙ ПОСОЛ", 
    "НАЧАЛЬНИК ГЕНЕРАЛЬНОГО ШТАБУ", 
    "ГОЛОВНОКОМАНДУВАЧ ЗБРОЙНИХ СИЛ УКРАЇНИ", 
    "КОМАНДУВАЧ СУХОПУТНИХ ВІЙСЬК ЗБРОЙНИХ СИЛ УКРАЇНИ", 
    "КОМАНДУВАЧ ПОВІТРЯНИХ СИЛ ЗБРОЙНИХ СИЛ УКРАЇНИ", 
    "КОМАНДУВАЧ ВІЙСЬКОВО-МОРСЬКИХ СИЛ ЗБРОЙНИХ СИЛ УКРАЇНИ", 
    "КОМАНДУВАЧ",
    "ДЕРЖАВНОГО", 
    "ДЕРЖАВНИХ", 
    "ДЕРЖАВНИЙ", 
    "ДЕРЖАВНІ", 
    "ПРОКУРАТУРИ", 
    "ПРОКУРАТУРА", 
    "СЛУЖБИ БЕЗПЕКИ УКРАЇНИ", 
    "ГОЛОВА АПЕЛЯЦІЙНОГО СУДУ", 
    "АПЕЛЯЦІЙНОГО СУДУ", 
    "КЕРІВНИК АДМІНІСТРАТИВНОГО",
    "КЕРІВНИК АДМІНІСТРАТИВНОЇ",
    "КАЗЕННИХ", 
    "КАЗЕННОГО", 
    "ПОЛІТИЧНИХ ПАРТІЙ", 
    "ПОЛІТИЧНА ПАРТІЯ",
    "ПОЛІТИЧНОЇ ПАРТІЇ"
  ]
  const coincidences = pepPosts.filter(postItem => {
    return post.includes(postItem) || postItem.includes(post)
  })

  return coincidences.length > 0
}
export {
  trimExceededLength,
  isPep,
}